HELP_BUTTON_TEXT = "Помощь"
USER_INFO_BUTTON_TEXT = "Информация о пользователе"
CONTINUE_BUTTON_TEXT = "Продолжить"

INFO_TEXT = f"""Для продолжения нажмите на кнопку <b>{CONTINUE_BUTTON_TEXT}</b>.\nДля получения помощи нажмите на кнопку
<b>{HELP_BUTTON_TEXT}</b>.\nДля получения информации о пользователе нажмите на кнопку <b>{USER_INFO_BUTTON_TEXT}</b>."""

HELP_TEXT = f"""Это бот <b>Ассистент по закупкам</b>\n\n
Для начала работы нажмите на синюю кнопку <b>Меню</b> слева от строки ввода, а после на <b>/start</b>.\n
Либо самостоятельно отправьте сообщение с текстом <b>/start</b>"""
